# Ćwiczenia z Pandas — Rozwiązania

**ZADANIE: Zaimportuj pandas**

In [24]:
# CODE HERE

In [2]:
import pandas as pd

**ZADANIE: Wczytaj plik bank.csv znajdujący się w folderze 01-Crash-Course-Pandas. Zwróć uwagę na lokalizację pliku .csv! Nie publikuj pytań na forum QA, jeśli nie możesz tego rozwiązać — uruchom bezpośrednio notatnik z rozwiązaniami, aby zobaczyć, jak to zrobić.**

In [3]:
df = pd.read_csv('bank.csv')

**ZADANIE: Wyświetl pierwsze 5 wierszy zbioru danych**

In [4]:
# CODE HERE

In [5]:
df.head()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,30,unemployed,married,primary,no,1787,no,no,cellular,19,oct,79,1,-1,0,unknown,no
1,33,services,married,secondary,no,4789,yes,yes,cellular,11,may,220,1,339,4,failure,no
2,35,management,single,tertiary,no,1350,yes,no,cellular,16,apr,185,1,330,1,failure,no
3,30,management,married,tertiary,no,1476,yes,yes,unknown,3,jun,199,4,-1,0,unknown,no
4,59,blue-collar,married,secondary,no,0,yes,no,unknown,5,may,226,1,-1,0,unknown,no

**ZADANIE: Jaki jest średni wiek osób w zbiorze danych?**

In [6]:
# CODE HERE

In [7]:
df['age'].mean()

41.17009511170095

**ZADANIE: Jaki jest stan cywilny najmłodszej osoby w zbiorze danych?**

[PODPOWIEDŹ](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.idxmin.html)

In [8]:
# CODE HERE

In [9]:
df['age'].idxmin()

503

In [10]:
df.iloc[503]['marital']

'single'

**ZADANIE: Ile jest unikalnych kategorii zawodów?**

In [11]:
# CODE HERE

In [12]:
df['job'].nunique()

12

**ZADANIE: Ile osób przypada na każdą kategorię zawodu? (Zerknij na oczekiwany wynik)**

In [13]:
# CODE HERE

In [14]:
df['job'].value_counts()

job
management       969
blue-collar      946
technician       768
admin.           478
services         417
retired          230
self-employed    183
entrepreneur     168
unemployed       128
housemaid        112
student           84
unknown           38
Name: count, dtype: int64

**ZADANIE: Jaki procent osób w zbiorze danych był w związku małżeńskim? **

In [15]:
#CODE HERE

In [16]:
# Many, many ways to do this one! Here is just one way:
100*df['marital'].value_counts()['married']/len(df)

# df['marital].value_counts()

61.86684361866843

**ZADANIE: Istnieje kolumna "default". Użyj metody .map() z pandas, aby utworzyć nową kolumnę o nazwie "default code", która zawiera 0, jeśli nie było zaległości, lub 1, jeśli zaległość była. Następnie pokaż head DataFrame z tą nową kolumną.**

[Pomocny link 1](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.map.html)

[Pomocny link 2](https://stackoverflow.com/questions/19798153/difference-between-map-applymap-and-apply-methods-in-pandas)

In [17]:
df['default code'] = df['default'].map({'no':0,'yes':1})

In [18]:
df.head()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y,default code
0,30,unemployed,married,primary,no,1787,no,no,cellular,19,oct,79,1,-1,0,unknown,no,0
1,33,services,married,secondary,no,4789,yes,yes,cellular,11,may,220,1,339,4,failure,no,0
2,35,management,single,tertiary,no,1350,yes,no,cellular,16,apr,185,1,330,1,failure,no,0
3,30,management,married,tertiary,no,1476,yes,yes,unknown,3,jun,199,4,-1,0,unknown,no,0
4,59,blue-collar,married,secondary,no,0,yes,no,unknown,5,may,226,1,-1,0,unknown,no,0

**ZADANIE: Używając metody pandas .apply(), utwórz nową kolumnę o nazwie "marital code". Ta kolumna powinna zawierać skrócony kod, czyli pierwszą literę stanu cywilnego (np. "m" dla "married", "s" dla "single" itd.). Spróbuj zrobić to wyrażeniem lambda. Jest wiele sposobów na to zadanie!**

[Podpowiedź](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.apply.html)

In [19]:
# CODE HERE

In [20]:
df['marital code'] = df['marital'].apply(lambda status: status[0])

In [21]:
df.head()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y,default code,marital code
0,30,unemployed,married,primary,no,1787,no,no,cellular,19,oct,79,1,-1,0,unknown,no,0,m
1,33,services,married,secondary,no,4789,yes,yes,cellular,11,may,220,1,339,4,failure,no,0,m
2,35,management,single,tertiary,no,1350,yes,no,cellular,16,apr,185,1,330,1,failure,no,0,s
3,30,management,married,tertiary,no,1476,yes,yes,unknown,3,jun,199,4,-1,0,unknown,no,0,m
4,59,blue-collar,married,secondary,no,0,yes,no,unknown,5,may,226,1,-1,0,unknown,no,0,m

**ZADANIE: Jaki był najdłuższy czas trwania (duration)?**

In [22]:
# CODE HERE

In [23]:
df['duration'].max()

3025

**ZADANIE: Jaki jest najczęściej występujący poziom wykształcenia wśród osób bezrobotnych?**

In [24]:
# CODE HERE

In [25]:
df[df['job']=='unemployed']['education'].value_counts()

education
secondary    68
tertiary     32
primary      26
unknown       2
Name: count, dtype: int64

**ZADANIE: Jaki jest średni wiek wśród osób bezrobotnych?**

In [26]:
# CODE HERE

In [27]:
df[df['job']=='unemployed']['age'].mean()

40.90625